УправлениеСдачейКвартир/src/Documents/УстановкаЦенКвартир/УстановкаЦенКвартир.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенКвартир</name>
  <registerRecords>InformationRegister.ЦеныНаКвартиры</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеныНаКвратиры</name>
    <attributes>
      <name>Квартира</name>
      <type>
        <types>CatalogRef.Квартиры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеСдачейКвартир/src/InformationRegisters/ЦеныНаКвартиры/ЦеныНаКвартиры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаКвартиры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеСдачейКвартир/src/Documents/УстановкаЦенКвартир/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЦеныНаКвартиры
	Движения.ЦеныНаКвартиры.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныНаКвратиры из ЦеныНаКвратиры Цикл
		Движение = Движения.ЦеныНаКвартиры.Добавить();
		Движение.Период = Дата;
		Движение.Квартира = ТекСтрокаЦеныНаКвратиры.Квартира;
		Движение.Цена = ТекСтрокаЦеныНаКвратиры.Цена;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
